In [1]:
import numpy as np
import pandas as pd
df=pd.DataFrame({"col1":[1,2,3,4],"col2":[444,555,666,444],"col3":["abc","ghd","def","ghe"]})

In [2]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  ghd
2     3   666  def
3     4   444  ghe

In [3]:
df["col2"].unique()

array([444, 555, 666], dtype=int64)

In [5]:
len(df["col2"].unique())

3

In [6]:
df["col2"].value_counts()

444    2
666    1
555    1
Name: col2, dtype: int64

In [7]:
def time2(x):
    return x*2

In [11]:
df[["col1","col2"]].apply(time2)

   col1  col2
0     2   888
1     4  1110
2     6  1332
3     8   888

In [12]:
df["col3"].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [ ]:
#sử dụng lambda thay thế cho hàm x2 ở phía trên áp dụng cho cột col2

In [13]:
df["col2"].apply(lambda x:x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [14]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [15]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [16]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [19]:
data={"A":["foo","foo","foo","bar","bar","bar"],
      "B":["one","one","two","two","one","one"],
      "C":["x","y","x","y","x","y"],
      "D":[1,3,2,5,4,1]}

In [20]:
df=pd.DataFrame(data)

In [21]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [25]:
result=df.pivot_table(values="D",index=["A","B"],columns=["C"])

In [26]:
result

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN